update main docs and archive some docs
